home/programs/emacs/emacs.org
*** Main Dired Configuration

By default, I want dired to look very minimal. This lack of clutter makes it easier to focus on what I am doing in the file manager. This is also the approach I try to take with other parts of emacs as well. By default, I have file details (owner, permissions, last modified, etc.) hidden. I have other changes as well, use the system trash can instead of deleting, that are under the ~:config~ part of the ~use-package~ declaration.

The keybindings are a hybrid of my normal state and the default dired keybindings.

#+begin_src emacs-lisp
  ;; ===Dired===
  (use-package dired
    :hook
    (dired-mode . dired-hide-details-mode) ; don't show file details by default
    (dired-mode . hl-line-mode) ; Highlight the line the cursor is on
    ;; TODO: create a dired-find-file-dwim for external programs
    :bind ( :map dired-mode-map
            ;; ===Top Row===
            ;; ("1" . )
            ;; ("!" . )
            ;; ("2" . )
            ;; ("@" . )
            ;; ("3" . )
            ;; ("#" . )
            ;; ("4" . )
            ;; ("$" . )
            ;; ("5" . )
            ;; ("%" . )
            ;; ("6" . )
            ;; ("^" . )
            ;; ("7" . )
            ;; ("&" . )
            ;; ("8" . )
            ;; ("*" . )
            ;; ("9" . )
            ;; ("(" . )
            ;; ("0" . )
            ;; (")" . )

            ;; ===2nd Row===
            ;; ("TAB"  . )
            ;; ("BTAB" . )
            ("q" . quit-window)
            ;; ("Q" . )
            ;; ("w" . )
            ;; ("W" . )
            ;; ("e" . )
            ;; ("E" . )
            ("r" . dired-do-rename)
            ("R" . dired-toggle-read-only)
            ("t" . dired-toggle-marks)
            ;; ("T" . )
            ;; ("y" . )
            ;; ("Y" . )
            ("u" . dired-unmark)
            ("U" . dired-unmark-all-marks)
            ("i" . dired-isearch-filenames-regexp)
            ("I" . dired-do-isearch-regexp)
            ;; ("o" . )
            ("O" . dired-do-chown)
            ("p" . dired-previous-line)
            ;; ("P" . )
            ("-" . negative-argument)
            ;; ("_" . )

            ;; ===3rd Row===
            ("<escape>" . keyboard-quit)
            ;; ("a" . )
            ;; ("A" . )
            ;; ("s" . )
            ;; ("S" . )
            ("d" . dired-do-kill-lines)
            ("D" . dired-do-delete)
            ("f" . find-file)
            ;; ("F" . )
            ("g" . revert-buffer)
            ;; ("G" . )
            ("h" . dired-up-directory)
            ;; ("H" . )
            ("j" . dired-next-line)
            ;; ("J" . )
            ("k" . dired-previous-line)
            ;; ("K" . )
            ("l" . dired-find-file)
            ("L" . dired-find-file-other-window)
            ;; (";" . )
            ;; (":" . )
            ("RET" . dired-find-file)
            ;; ("S-RET" . )

            ;; ===4th Row===
            ("z" . dired-undo)
            ;; ("Z" . )
            ("x" . dired-mark)
            ;; ("X" . )
            ("c" . dired-do-copy)
            ("C" . dired-do-copy-regexp)
            ("v" . dired-find-file-other-window)
            ;; ("V" . )
            ;; ("b" . )
            ;; ("B" . )
            ("n" . dired-next-line)
            ;; ("N" . )
            ("m" . dired-mark-files-regexp)
            ("M" . dired-do-chmod)
            ;; ("," . )
            ;; ("<" . )
            ;; ("." . )
            ;; (">" . )
            ("/" . dired-goto-file)
            ;; ("?" . )
            ;; ("'"  . )
            ;; ("\"" . )
            :map cur/sub-leader-keymap
            ("d" . dired)
            )
    :config
    (setq delete-by-moving-to-trash t)
    (setq dired-recursive-copies t)
    (setq dired-recursive-deletes t)
    (setq dired-listing-switches "-A -G -F -h -l -v --group-directories-first --time-style=long-iso")
    (setq dired-dwim-target t)
    (setq dired-auto-revert-buffer #'dired-directory-changed-p)
    (setq dired-free-space nil)
    (setq dired-make-directory-clickable t)
    (setq dired-mouse-drag-files t))

  (provide 'cur-config-dired)
#+end_src

** Faces, themes, and eye candy configurations (=cur-config-faces.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-faces.el
:END:

I think that emacs should have a lot of eye candy, especially since I spend so much time in it. These are my configurations for emacs' faces, theming and ui settings essentially.

*** Default Font

JetBrains Mono supremacy.

#+begin_src emacs-lisp
  ;; ===Default Font===
  (add-to-list 'default-frame-alist
               '(font . "JetBrains Mono Nerd Font-11"))
#+end_src

*** Default Opacity

I have this transparency set to be the same as with my Alacritty config. This adds more consistency to my computing experience. It also just looks really cool.

#+begin_src emacs-lisp
  ;; ===Default Opacity===
  (add-to-list 'default-frame-alist
               '(alpha-background . 85))
#+end_src

*** TODO Custom themes

I have several custom themes in a directory weirdly named themes. These are the =everforest= and =kanagawa= themes. I have changed these from the originals. TODO: add the links to the original themes.

#+begin_src emacs-lisp
  ;; ===Themes Path===
  (add-to-list 'custom-theme-load-path (locate-user-emacs-file "themes"))
#+end_src

*** Doom themes

Doom themes are a theme pack specifically for the Doom Emacs distribution, but work well without doom as well. I have a function that sets some faces based on the theme in ~custom-enabled-themes~. This function is more than just a little jank and I plan on creating my own themes instead of trying to hack around ones made by someone else.

#+begin_src emacs-lisp
    ;; ===Doom Emacs Themes===
    (use-package doom-themes
      :demand t
      :init
      (defun cur/theme-override ()
        "Change faces depending on what the value of `custom-enabled-themes' is."
        (cond ((member 'doom-gruvbox custom-enabled-themes)
               (set-face-attribute 'secondary-selection nil
                                   :background "#504945"))
              ((member 'doom-flatwhite custom-enabled-themes)
               (set-face-attribute 'haskell-operator-face nil
                                   :background (doom-color 'bg)
                                   :foreground (doom-color 'fg))
               (set-face-attribute 'haskell-type-face nil
                                   :background (doom-color 'fw-teal-blend)
                                   :foreground (doom-color 'fw-teal-text))
               (set-face-attribute 'haskell-constructor-face nil
                                   :background (doom-color 'fw-orange-blend)
                                   :foreground (doom-color 'fw-orange-text)))
              (t t)))
      (defun cur/load-theme (theme)
        "Load THEME, disabling all other currently enabled themes. Then
    check for overrides with `cur/theme-override'."
        (interactive
         (list
          (intern (completing-read "Cur Custom Themes: "
                                   (mapcar #'symbol-name
                                           (custom-available-themes))))))
        (condition-case nil
            (progn
              (mapc #'disable-theme custom-enabled-themes)
              (load-theme theme t)
              (cur/theme-override))
          (error "Problem loading theme %s" theme)))
      :bind (:map cur/toggle-map
                  ("C-t" . cur/load-theme))
      :config
      (cur/load-theme 'doom-oceanic-next))
#+end_src

*** Autothemer

A library used by =catppuccin= and =kanagawa=.

#+begin_src emacs-lisp
  ;; ===Autothemer===
  (use-package autothemer)
#+end_src

*** Catppuccin Theme

[[https:github.com/catppuccin/catppuccin][Link]] to the catppuccin theme.

#+begin_src emacs-lisp
  ;; ===Catppuccin Theme===
  (use-package catppuccin-theme
    :after (autothemer))
#+end_src

*** Text Scaling Hydra

A simple hydra that allows me to interactively set the size of the text in a buffer.

#+begin_src emacs-lisp
  ;; ===Text Scaling===
  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("k" text-scale-increase "in")
    ("j" text-scale-decrease "out")
    ("f" nil "finished" :exit t)
    ("RET" nil "finished" :exit t))
  (define-key cur/toggle-map (kbd "C-s") 'hydra-text-scale/body)
#+end_src

*** Ef-themes

Themes made by Protesilaos, also known as Prot.

#+begin_src emacs-lisp
  ;; ===Ef-Themes===
  (use-package ef-themes)
    ;; :config
    ;; (cur/load-theme 'ef-tritanopia-dark))
#+end_src

*** Nerd Icons Ibuffer

Adds Icons to ~ibuffer~. Not really a face thing but I don't have a dedicated ~ibuffer~ module so it goes here instead.

#+begin_src emacs-lisp
  ;; ===Ibuffer Icons===
  (use-package nerd-icons-ibuffer
    :hook (ibuffer-mode . nerd-icons-ibuffer-mode))
#+end_src

*** Spacious Padding

It adds padding and makes emacs look better.

#+begin_src emacs-lisp
  ;; ===Spacious Padding===
  (use-package spacious-padding
    :config
    (setq spacious-padding-widths
          '(:internal-border-width 8
            :header-line-width 0
            :mode-line-width 0
            :tab-width 0
            :right-divider-width 18
            :scroll-bar-width 0
            :fringe-width 0))
    (setq spacious-padding-subtle-mode-line nil)
    (spacious-padding-mode 1))

  (provide 'cur-config-faces)
#+end_src

** Completion system configurations (=cur-config-completion.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-completion.el
:END:

This section is not about code completion. Rather, this is my configuration for Emacs' completion system and the main interfaces that use them. For code completion please go see =cur-config-ide.el= and ~company-mode~.

Currently I am using the [[https:github.com/abo-abo/swiper/][ivy/counsel/swiper]] suite for doing completions in emacs. I like it but I know that the vertico/marginelia/consult/embark chain is better, faster, and more modern. I plan to make the switch at some point but for now I sticking with ivy.

*** Completions Styles

#+begin_src emacs-lisp
  (use-package minibuffer
    :config
    (setq completion-styles '(basic substring orderless))
    (setq completion-category-overrides
          '((file      (styles . (basic partial-completion orderless)))
            (kill-ring (styles . (emacs22 orderless))))))

  (use-package orderless
    :bind ( :map minibuffer-local-completion-map
            ("SPC" . nil)
            ("?" . nil))
    :config
    (setq orderless-matching-styles '(orderless-prefixes orderless-regexp)))
#+end_src

*** Vertico

#+begin_src emacs-lisp
  (use-package vertico
    :config
    (vertico-mode 1))
#+end_src

*** Marginalia

#+begin_src emacs-lisp
  (use-package marginalia
    :config
    (marginalia-mode 1))
#+end_src

*** Vertico Posframe

#+begin_src emacs-lisp
  (use-package vertico-posframe
    :config
    (vertico-posframe-mode 1))
#+end_src

*** Consult

#+begin_src emacs-lisp
  (use-package consult
    :demand t
    :bind (("C-x b" . consult-buffer)
           ("M-g i" . consult-imenu)
           ("M-y"   . consult-yank-pop)))

  (provide 'cur-config-completion)
#+end_src

** Window management configurations (=cur-config-window.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-window.el
:END:

*** Display Buffer Alist

These are my settings for ~display-buffer-alist~ so windows just Do What I Mean.

#+begin_src emacs-lisp
  (use-package cur-window
    :config
    (setq window-sides-slots
          '(1 1 1 1))
    (setq display-buffer-alist
          '(("\\`\\*Async Shell Command\\*\\'"
             (display-buffer-no-window))
            ("\\*Org Src.*"
             (display-buffer-same-window))
            ((or (derived-mode . compilation-mode)
                 (derived-mode . geiser-mode)
                 (derived-mode . grep-mode)
                 (derived-mode . help-mode)
                 (derived-mode . Info-mode)
                 (derived-mode . rg-mode)
                 (derived-mode . woman-mode))
             (cur-window-display-buffer-below-or-pop)
             (body-function . cur-window-select-fit-to-size))
            ((derived-mode . occur-mode)
             (display-buffer-reuse-window
              display-buffer-below-selected)
             (dedicated . t)
             (body-function . cur-window-select-fit-to-size))
            ((or (derived-mode . justl-mode)
                 "\\*eshell .*"
                 "\\*vterm.*"
                 "\\*.*-eat\\*"
                 "justl - .*")
             (display-buffer-reuse-window
              display-buffer-at-bottom)
             (dedicated . t)
             (window-height . 0.25)))))

  (provide 'cur-config-window)
#+end_src

** IDE configurations (=cur-config-ide.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-ide.el
:END:

Emacs can be made to have all the features of a modern text editor and then some.

*** LSP-mode

Lsp-mode is my chosen language server protocol support package. I chose this over eglot because of the richer features and (at the time that I started using lsp) more mature state. I will revisit elgot in the future but for now I am perfectly happy with lsp-mode.

#+begin_src emacs-lisp
  ;; ===LSP Mode===
  (use-package lsp-mode
    :demand t
    :hook
    (lsp-mode  . lsp-enable-which-key-integration)
    :custom
    (lsp-keymap-prefix "C-c C-M-l" "lsp mode keymap")
    :bind (:map lsp-mode-map
                ("C-c C-a" . lsp-execute-code-action)  ; code actions
                ("C-c C-e" . lsp-treemacs-errors-list) ; treemacs error list
                ("C-c f"   . lsp-find-references)      ; find references
                ("C-c r"   . lsp-find-definition))     ; find definitions
    :config
    (lsp-deferred)
    (setq gc-cons-threshold (* 100 1024 1024))
    (setq read-process-output-max (* 3 1024 1024))
    (setq lsp-idle-delay 0.500)
    (setq lsp-lens-enable nil)
    (lsp-enable-which-key-integration t))
#+end_src

