home/programs/emacs/emacs.org
** Configurations for Gemini and the smolnet (=cur-config-smol-net.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-smol-net.el
:END:

#+begin_src emacs-lisp
  ;; ===Gemini-Mode===
  (use-package gemini-mode)

  ;; ===Org Gemini Exporter==
  (use-package ox-gemini)

  ;; ===Elpher Gemini/Gopher Client===
  (use-package elpher
    :custom
    (elpher-default-url-type "gemini"))

  (provide 'cur-config-smol-net)
#+end_src

** Elcord and making myself look productive to my friends (=cur-config-elcord.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-elcord.el
:END:

#+begin_src emacs-lisp
  (use-package elcord)

  (provide 'cur-config-elcord)
#+end_src

** Direnv integration (=cur-config-direnv.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-direnv.el
:END:

#+begin_src emacs-lisp
  ;; ===Envrc===
  (use-package envrc
    :config
    (envrc-global-mode))

  (provide 'cur-config-direnv)
#+end_src

* Custom Library Modules (=cur-lisp=)

** Base Values and Functions (=cur-base.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-lisp/cur-base.el
:END:

#+begin_src emacs-lisp
  ;;; cur-base.el --- The base of my customizations for emacs

  ;;; Commentary:
  ;; This is the base of my extensions to Emac's functionality.
  ;; Do try this at home kids.

  ;;; Code:

  (defgroup cur-base ()
    "Base functions and variables for my Emacs configuration."
    :group 'editing)

  (provide 'cur-base)
  ;;; cur-base.el ends here
#+end_src

** Eshell aliases and extensions (=cur-eshell.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-lisp/cur-eshell.el
:END:

#+begin_src emacs-lisp
  ;;; cur-eshell.el --- My exensions of the Emacs Shell

  ;;; Commentary:

  ;;; Code:

  (require 'eshell)
  (require 'files)
  (require 'dired)

  (defun cur-eshell-prompt ()
    "A minimal and colourful prompt for `eshell'.
  Set `eshell-prompt-function' to this function to enable."
    (concat
     (propertize "[" 'face 'ansi-color-red)
     (propertize (eshell/whoami) 'face 'ansi-color-yellow)
     (propertize "@" 'face 'ansi-color-green)
     (propertize (system-name) 'face 'ansi-color-blue)
     " "
     (propertize (concat (eshell/pwd)) 'face 'ansi-color-magenta)
     (propertize "]" 'face 'ansi-color-red)
     (propertize "$ " 'face 'bold)))

  (defun eshell/ff (&optional file)
    "Eshell alias to open FILE.
  Will call `find-file' interactively if no file is specified."
    (cond (file
           (find-file file))
          (t
           (call-interactively 'find-file))))

  (defun eshell/dir (&optional dir)
    "Eshell alias to open `dired' at DIR.
  Will call `dired' on current directory if no directory is specified."
    (cond (dir
           (dired dir))
          (t
           (dired "."))))

  (defvar cur-eshell-prompt-regexp
    "^\\[[^]]*\\]\\[?[[:digit:]]*\\]?[#$λ] "
    "Regex for the `cur-eshell-prompt' prompt.")

  (provide 'cur-eshell)
  ;;; cur-base.el ends here
#+end_src

** Tmux Integration (=cur-tmux.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-lisp/cur-tmux.el
:END:

#+begin_src emacs-lisp
  ;;; cur-tmux.el --- Integrating Emacs with a tmux

  ;;; Commentary:

  ;;; Code:

  (defvar cur-tmux-session-name
    "emacs"
    "The name of the session Emacs will try to connect to and manipulate.")

  (defun cur-tmux--remove-ansi-escape-colors (str)
    "Remove ansi escape color codes from STR."
    (replace-regexp-in-string "\\[.*?m" "" str))

  (defun cur-tmux--list-session-names ()
    "List the names of all active tmux sessions."
    (let* ((session-names (string-split
                          (with-temp-buffer
                            (cur-tmux--exec-command '("ls" "-F" "#{session_name}") t)
                            (buffer-string)) "\n" t)))
      (remove nil session-names)))

  (defun cur-tmux-emacs-session-p ()
    "Return t of `cur-tmux-session-name' is an active session."
    (if (member cur-tmux-session-name (cur-tmux--list-session-names))
        t
      nil))

  (defun cur-tmux--create-session (&optional command)
    "Create session named after `cur-tmux-session-name' if one does not exist.
  Will return nil if session exists and will return t if session is
  created successfully.  Will error if tmux is not found or if tmux
  returns an error value.
  If COMMAND is not nil, it will be passed as the initial shell command to tmux."
    (if (cur-tmux-emacs-session-p)
        nil
      (let* ((exit-code (cond
                         (command (call-process "tmux" nil nil nil
                                                "new" "-d" "-s" cur-tmux-session-name command))
                         (t (call-process "tmux" nil nil nil
                                          "new" "-d" "-s" cur-tmux-session-name)))))
        (if (= exit-code 0)
            t
          (error "Tmux was unable to create a new session with that name")))))

  ;; TODO: make it so that you can set the directory of the shell.
  (defun cur-tmux--exec-command-with-code (args &optional buffer)
    "Call tmux with ARGS, output to BUFFER and return exit code.
  ARGS must be a list strings that corespond to tmux flags and arguments."
    (apply 'call-process "tmux" nil buffer nil args))

  (defun cur-tmux--exec-command (args &optional buffer)
    "Call `cur-tmux--exec-command' with ARGS and BUFFER, return t or nil.
  Nil is returned if there is an error and t is returned if there is no error.
  ARGS must be a list strings that corespond to tmux flags and arguments."
    (let ((exit-code (cur-tmux--exec-command-with-code args buffer)))
      (if (> exit-code 0)
          nil
        t)))

  (defun cur-tmux--exec-command-err-on-err (args &optional buffer)
    "Call `cur-tmux--exec-command' with ARGS and BUFFER, `error' on error."
    (let* ((exit-code (cur-tmux--exec-command-with-code args buffer)))
      (if (= exit-code 0)
          t
        (error "Tmux terminated with exit code %d" exit-code))))

  (defun cur-tmux--new-window (window-name &optional command)
    "New window named WINDOW-NAME, executing COMMAND if it is non nil."
    (let* ((args (list "new-window" "-n" window-name "-t" cur-tmux-session-name))
           (args* (if command
                      (append args (list command))
                    args)))
      (cur-tmux--exec-command-err-on-err args*)))

  (defun cur-tmux--list-windows (&optional index)
    "List windows in `cur-tmux-session-name'.
  If INDEX is not nil, output the with format \"#{window_index}: #{window_name}\"."
    (let* ((args (list "list-windows" "-t" cur-tmux-session-name "-F" ))
           (args* (if index
                      (append args '("#{window_index}: #{window_name}"))
                    (append args '("#{window_name}")))))
      (split-string
       (with-temp-buffer
         (cur-tmux--exec-command-err-on-err args* t)
         (buffer-string))
       "\n" t)))

  (defun cur-tmux-window-exists-p (window &optional index)
    "Check if WINDOW is a window in `cur-tmux-session-name'.
  If INDEX is not nil, check if there is a window named WINDOW with number INDEX.
  The behavior is similar to that of `member'."
    (cond
     (index (if (member (format "%d: %s" index window) (cur-tmux--list-windows index))
                t
              nil))
     (t (if (member window (cur-tmux--list-windows))
            t
          nil))))

  (provide 'cur-tmux)
  ;;; cur-tmux.el ends here
#+end_src

** Custom modeline (=cur-modline.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-lisp/cur-modeline.el
:END:

#+begin_src emacs-lisp
  ;;; cur/modeline.el --- My custom modeline -*- lexical-binding: t -*-

  ;;; Commentary:
  ;;
  ;; This is my custom modeline.  This is here bascially because I don't want to
  ;; use doom modeline.

  ;;; Code:
  (defgroup cur-modeline nil
    "My custom modeline that tries to be minimal."
    :group 'mode-line)
  
  (defgroup cur-modeline-faces nil
    "The faces for my custom modeline."
    :group 'cur-modeline)

  (defun cur-mode-line/padding ()
    "Function to return padding so `mode-line-end-spaces' will be right aligned."
    (let ((r-length (length (format-mode-line mode-line-end-spaces))))
      (propertize " "
                  'display `(space :align-to (- right ,r-length)))))

  (setq-default mode-line-format
                '("%e"
                  (:eval
                   (when (and (mode-line-window-selected-p) defining-kbd-macro)
                     (propertize "  KMACRO  " 'face 'font-lock-string-face)))
                  (:eval
                   (when (and (mode-line-window-selected-p)
                              (buffer-narrowed-p)
                              (not (derived-mode-p 'Info-mode 'help-mode 'special-mode 'message-mode)))
                     (propertize "  NARROWED  " 'face 'font-lock-constant-face)))
                  (:eval
                   (when (and (member 'meow features) (mode-line-window-selected-p))
                     (propertize (format "  %s  " (upcase (symbol-name meow--current-state)))
                                 'face 'highlight)))
                  "  "
                  (:eval
                   (when (mode-line-window-selected-p)
                     (cond (buffer-read-only
                            (propertize "RO" 'face 'shadow))
                           ((buffer-modified-p)
                            (propertize "**" 'face 'shadow))
                           (t
                            (propertize "RW" 'face 'shadow)))))
                  "  "
                  (:eval
                   (propertize (format "%s" (buffer-name)) 'face 'bold))
                  "  "
                  (:eval
                   (if (mode-line-window-selected-p)
                     (propertize (capitalize (symbol-name major-mode)) 'face 'warning)
                     (propertize (capitalize (symbol-name major-mode)) 'face 'shadow)))
                  (:eval (cur-mode-line/padding))))

  (provide 'cur-modeline)
  ;;; cur-modeline.el ends here
#+end_src

